cfd/channelCase_template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Mesh generated by generate_blockmesh.py
// Channel dimensions: L=40.0517mm, W=0.5064mm, H=0.5079mm
// Total cells: 110440 (251 x 20 x 22)

scale 0.001;  // Dimensions below are in mm, converted to meters

vertices
(
    (0       -0.253204  0)
    (50.051663  -0.253204  0)
    (50.051663  0.253204   0)
    (0       0.253204   0)
    (0       -0.253204  0.507859)
    (50.051663  -0.253204  0.507859)
    (50.051663  0.253204   0.507859)
    (0       0.253204   0.507859)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (251 20 22)
    simpleGrading
    (
        1
        (
            (0.5 0.5 1.1950)
            (0.5 0.5 0.8369)
        )
        (
            (0.5 0.5 1.1576)
            (0.5 0.5 0.8639)
        )
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
