cfd/channelCase_template/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;
deltaT          1;

writeControl    timeStep;
writeInterval   1;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc flowRatePatch(name=outlet)
}

// ************************************************************************* //
