cfd/channelCase_template/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default				none;
    div(phi,U)				Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
    default Gauss linear limited 0.333;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected;
}
