cfd/channelCase_template/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        tolerance 1e-7;
        relTol 0.01;
        smoother GaussSeidel;
    }

    U
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-8;
        relTol 0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent no;

    pRefCell 0;
    pRefValue 0;

    residualControl
    {
        p 1e-4;
        U 1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p 0.2;
    }
    equations
    {
        U 0.5;
    }
}
