cfd/channelCase_template/system/fvSolution.relaxed
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        tolerance 1e-8;
        relTol 0.005;
        smoother GaussSeidel;
    }

    U
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-9;
        relTol 0.05;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    consistent no;

    pRefCell 0;
    pRefValue 0;

    residualControl
    {
        p 1e-5;
        U 1e-6;
    }
}

relaxationFactors
{
    fields
    {
        p 0.1;
    }
    equations
    {
        U 0.3;
    }
}